// lib/server-data.ts
export const serverFeatures = [
  {
    title: "Режим выживания",
    description: "Испытайте выживание в Minecraft с уникальными настройками и испытаниями.",
    image: "/backgrounds/bg-3.png",
  },
  {
    title: "Уникальные плагины",
    description: "Наслаждайтесь особыми игровыми механиками с нашими эксклюзивными плагинами.",
    image: "/backgrounds/bg-4.png",
  },
  {
    title: "Экономическая система",
    description: "Торгуйте с другими игроками, используя нашу сбалансированную экономику.",
    image: "/backgrounds/bg-2.png",
  },
  {
    title: "PvP арены",
    description: "Проверьте свои навыки в бою против других игроков на наших специальных аренах.",
    image: "/backgrounds/bg-7.png",
  },
  {
    title: "Регулярные события",
    description: "Участвуйте в еженедельных мероприятиях с захватывающими наградами.",
    image: "/backgrounds/bg-1.png",
  },
  {
    title: "Дружелюбное сообщество",
    description: "Присоединяйтесь к нашему активному и отзывчивому сообществу игроков.",
    image: "/backgrounds/bg-6.png",
  },
];

export const serverRules = [
  "Уважайте других игроков: Запрещены оскорбления, травля и ненормативная лексика.",
  "Запрет гриферства: Нельзя разрушать или изменять постройки других без разрешения.",
  "Запрет читов и хаков: Использование читов приведёт к бану.",
  "Запрет спама: Не спамьте в чате и не злоупотребляйте CAPS LOCK.",
  "Следуйте указаниям администрации: Выполняйте инструкции модераторов.",
];